//
//  QuestionData.swift
//  Cherish
//
//  Created by 이가은 on 2022/08/03.
//

import Foundation

struct QuestionData {
    static let list : [Question : [String]] = [
        .life: ["이번 프로젝트에서 가장 이루고 싶은 건 무엇인가요?",
                "나는 앞으로 (          )가 기대돼요.",
                "아이디어를 발상해내면서 느꼈던 한계가 있다면, 무엇인가요?",
                "오늘 가장 인상 깊었던 질문은 무엇인가요? + 그 이유는 무엇인가요?",
                "investigation 과정에서 어려웠던 점 / 흥미로웠던 점은 무엇이었나요?",
                "우리팀이 정한 solution은 나에게 어떤 의미가 있나요?",
                "App을 정의해나가면서 어떤 어려웠던 점이 있었나요? 있었다면, 어떻게 해결했나요?",
                "자신만의 아이디어 도출 방법은 무엇인가요?",
                "오늘의 insight는 무엇인가요?",],
        .person: ["앱의 컨셉을 디자인에서 어떻게 녹였나요?",
                  "내가 디자인에서 놓쳤던 point가 있었다면 무엇인가요?",
                  "디자인에서 가장 중요한 것이 뭐라고 생각하나요?",
                  "오늘 받았던 디자인 피드백은 무엇인가요?",
                  "요즘 디자인에서 유행하는 패턴은 무엇인가요?",
                  "디자인의 영감을 얻었던 것이 있었다면 무엇이었나요?",
                  "타겟층에 어울리는 디자인을 구성하기 위해 어떤 노력을 했나요?"],
        .love: ["이번 프로젝트에서 하고 싶은 개발 skill은 무엇인가요?",
                "내가 현재 고민하고 있는 기능을 위해 공부해야 하는 key word는 무엇인가요?",
                "개발 과정에서 나에게 가장 어려운 시기는 언제인가요?",
                "오늘 겪었던 issue는 무엇인가요? 그리고 issue를 해결하기 위해 어떤 노력을 했나요?",
                "나의 개발 공부 방법의 장단점은 무엇인가요?",
                "요즘 누군가에게 물어보고 싶은 개발 관련 key word는 무엇인가요?",
                "오늘의 insight는 무엇인가요?",
                "챌린지를 끝내면서 나에게 해주고 싶은 말은?"]
    ]
}
