//
//  QuestionData.swift
//  Cherish
//
//  Created by 이가은 on 2022/08/03.
//

import Foundation

struct QuestionData {
    static let list : [Question : [String]] = [
        .life :["하루 중 가장 좋아하는 시간대는 언제인가요?","만약 지금처럼 산다면, 5년 후에 내 삶은 어떤 모습이 되어 있을까요 ? ","듣는 것만으로 나를 행복하게 해주는 말 한마디가 있나요 ? 있다면 무엇인지 이유와 함께 적어보세요.","나를 색으로 표현한다면 어떤 색일까요 ?","언젠가 만들고 싶은 취미가 있나요 ? 왜 그 취미를 가지고 싶나요 ? ","나는 어떤 옷을 좋아하는 사람인가요 ? 어떤 색을 좋아하는지, 어떤 스타일을 좋아하는 지 적어보세요.","방에 딱 하나의 액자를 걸 수 있다면, 어떤 사진을 액자에 넣고 싶나요 ?","요즘 가장 좋아하는 노래는 무엇인가요 ? 이유와 함께 적어보세요.","내 삶에서 가장 좋았던 여행은 언제였나요 ? 그곳에서 누구와 무엇을 했나요 ?","요즘의 삶에서 버려야 하는 게 있나요 ? 있다면 이유와 함께 적어보세요","최근 ‘나답다’라고 느꼈던 순간은 언제였나요? ","하고 있는 것만으로도 나를 행복하게 만들어주는 일이 있나요 ?","냐는 어떤 거에 몰입을 잘 하는 사람인가요 ? ","온전히 나만을 위한 하루가 주어진다면 어떻게 보내고 싶나요?","내 삶에서 가장 중요하다고 생각하는 단어는 무엇인가요 ?","나는 어려움이 닥쳤을 때, 어떻게 이겨내는 사람인가요 ? ","5년전 나는 어떤 사람이었고 그때의 가장 큰 고민은 무엇이었나요 ?","오늘을 두고두고 기억하고 싶은 날로 만들고 싶다면, 무엇을 해야 할까요 ?","살아오면서 가장 잘 했다고 생각하는 선택은 무엇인가요 ? ","오늘 하루를 세 단어로 표현해 본다면 ?","지금의 나는 인생의 어떤 타이밍에 서 있나요 ?","가끔씩 생각나는 어릴적 추억이 있나요 ?","요즘 하루 동안 무엇에 가장 많은 시간을 쓰고 있나요 ?","하루가 25시간이 된다면, 추가된 1시간을 어디에 쓰고 싶나요 ?","자주 반복하는 실수는 무엇인가요 ? 그리고 그 실수를 자주 하는 이유는 무엇인가요 ?","해본 적은 없지만 늘 해보고 싶었던 일이 있나요 ?","지금 이 순간, 나에게 가장 필요한 용기는 무엇인가요 ?","요즘 무엇을 배우고 싶나요 ?","내가 기억하는 “완벽한 하루” 는 어떤 날인가요? ","단 한 가지 것에 집중하신다면 무엇을 선택하시\n겠습니까?","나의 삶을 어떤 색깔로 칠하고 싶은가요?","나는 어떤 잠재력을 가지고 있는 사람인가요 ?","요즘 삶 속에서 반복해서 마주하는 고민은 무엇인가요 ?","살면서 가장 감사하게 생각하는 일은 무엇인가요?","나는 요즘 어떤 우물 안에 있는 걸까요 ?","어렸을 적 꿈은 무엇이었나요 ?","어린 시절 자라난 환경을 바꿀 수 있다면 무엇을 바꾸겠어요? "],
        .person :["내 삶에 가장 큰 영향을 끼친 사람은 누구인가요 ? ","나는 오늘 누구의 안부를 묻고 싶나요 ?","함께 늙어가고 싶은 사람이 있나요 ?","진정한 우정을 위해 가장 필요한 건 무엇이라고 생각하나요?","누군가에게 말 없는 배려를 느꼈던 적이 있었나요 ?","나와 가장 닮았다고 생각되는 영화/만화/드라마 속 주인공은 누구인가요?","나와 가장 친한 사람을 소개하는 글을 적어보세요","나와 친한 사람들의 공통점은 무엇인가요 ?","계속해서 그리운 누군가가 있나요 ? 그 사람과 대화를 나눌 수 있다면 어떤 말을 전하고 싶나요 ?","내가 되고 싶은 ‘이상적인 사람’은 어떤 사람인가요 ?","최근 나에게 영감을 주었던 사람은 누구인가요 ? 그 사람에게서 어떤 영감을 얻었나요 ?","나를 키워주신 분께 하고 싶은 말이 있나요 ?","나랑 잘 맞지 않은 사람의 성격은 무엇인가요 ?","내가 가장 닮고 싶은 사람이 있나요 ? 있다면 이유와 함께 적어보세요.","요즘 가장 가까이 지내고 있는 사람은 내게 어떤 의미가 있는 사람인가요 ?","오래도록 내 마음 속에 남은 누군가의 한마디를 적어보세요.","요즘에 만나고 싶은 사람이 있나요? 그 사람과 무엇을 하고 싶나요 ?","내 말을 가장 잘 들어주는 사람은 누구인가요 ? 그렇게 생각한 이유와 함께 적어보세요","주변 사람들에게 가장 많이 듣는 칭찬은 무엇인가요 ?","누군가에게 도움을 받은 일 중 가장 기억에 남는 일은 무엇인가요 ?","요즘 가장 고마운 사람은 누구인가요 ?","나를 요즘 행복하게 만드는 사람이 있나요 ?","최근 나를 가장 화나게 했던 사람에게 가장 듣고 싶었던 말은 무엇이었나요 ?","나와 가장 친한 친구는 나에 대해서 뭐라고 설명할까요 ?","삶에서 의지가 되는 한 사람이 있나요 ? 만약 그 사람이 지금 내 삶에 따뜻한 조언을 해준다면 뭐라고 말할까요 ?","주변 사람들에게 나는 어떤 사람이고 싶나요 ?"],
        .love :["요즘 무엇을 ‘사랑’하고 있나요 ?","무언가를 사랑하는 마음은 나를 어떻게 달라지게 하나요 ?","내가 사랑하는 공간에서의 가장 기억에 남는 추억을 적어보세요.","사랑하는 사람에게 꼭 듣고 싶은 말은 무엇인가요 ?","내가 사랑받고 있다는 것을 느끼게 해준 그 사람의 애정표현은 무엇인가요 ?","내가 생각하는 가장 이상적인 연인 관계는 어떤 모습인가요 ?","고백했던, 혹은 고백 받았던 날의 기분은 어땠나요 ?","“사랑하다”와 가장 비슷한 단어는 무엇이라고 생각하나요 ? 그 이유와 함께 적어보세요.","사랑이 가득했던 기억 하나를 떠올려 본다면 그 기억 속에는 무엇이 있나요 ?","누군가의 사랑이 담긴 물건이 있나요 ? 있다면 그 물건을 보면 떠오르는 추억을 함께 적어보세요.","나에게 가장 소중한 추억은 무엇인가요 ?","내가 생각하는 진정한 사랑이란 무엇인가요?","사랑은 나의 인생에 있어서 얼마나 중요한가요?","5개의 단어를 사용해 사랑을 묘사한다면? ","내가 10년 전에 생각했던 사랑이란 무엇이었나요 ?"]
    ]
    
    static var allList: [String] = {
        var questionAllList: [String] = []
        let questionCategoryList = Question.allCases
        
        questionCategoryList.forEach { questionCategory in
            if let question = list[questionCategory] {
                questionAllList += question
            }
        }
        return questionAllList
    }()
    
    static func randomQuestion(amount: Int) -> [String] {
        allList[randomPick: 3]
    }
}
